In [26]:
import pandas as pd
import numpy as np

### Creating a DataFrame

In [27]:
data = {
    'Name': ['Jhon','Anna','Peter','Linda'],
    'Age' : [28,34,29,42],
    'City': ['New York','Paris','Berlin','London'],
    'Salary': [65000,70000,82000,85000]
}
df = pd.DataFrame(data)

In [29]:
df

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   82000
3  Linda   42    London   85000

In [33]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df1 = pd.DataFrame(data_list)
header = ["Name","Age","City","Salary"]
df1 = pd.DataFrame(data_list,columns=header)
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

**Selection And Indexing Of Column**

In [34]:
df1["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [36]:
df1[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

**Creating a New Column**

In [37]:
df1["Designation"] = ["Doctor","Engineer","Scientist","Director"]

In [38]:
df1

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000   Scientist
3  Linda   42    London   85000    Director

**Removing Column**

In [47]:
df1.drop("Designation",axis=1,inplace=True)

In [48]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [49]:
df1.drop(0,axis=0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

**Selecting Rows**

In [51]:
df1.loc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [52]:
df1.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [53]:
df1.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

**Selecting Subset Of Rows and Column**

In [54]:
df.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [56]:
df.loc[[2,3]][["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

**Conditional Selection**

In [57]:
# I only want to see the people whosw age is above 30

In [58]:
df1[df1["Age"] > 30 ]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [59]:
# I only want people whose age is above 30 and their city is Paris

In [61]:
df1[(df1["Age"]>30) & (df1["City"] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000